{"batch_key_dict":{"mapping":{"transfer:PLANT-001-T1-1":2,"transport:PLANT-002-HALB-2":7,"transport:PLANT-003-T0-3":12,"transport:PLANT-001-T1-1":6,"transport:PLANT-003-T1-3":13,"transport:PLANT-002-T1-2":9,"batch:PLANT-004-T1-4":14,"transport:PLANT-004-HALB-4":15,"transport:PLANT-003-HALB-3":11,"<UNK>":0,"transport:PLANT-001-HALB-1":4,"transport:PLANT-002-T0-2":8,"batch:PLANT-001-T1-1":1,"transport:PLANT-001-T0-1":5,"batch:PLANT-003-T1-3":10,"transport:PLANT-004-T1-4":17,"batch:PLANT-002-T1-2":3,"transport:PLANT-004-T0-4":16},"frozen":true},"edge_type_dict":{"mapping":{"<UNK>":0,"finish_to_start":1},"frozen":true},"resource_name_dict":{"mapping":{"labor_pool:PLANT-001-POOL":7,"machine:PLANT-001-M-004":25,"tool:PLANT-003-TOOL-FURNACE-01":33,"machine:PLANT-002-M-002":5,"tool:PLANT-001-TOOL-HOB-01":9,"labor_pool:PLANT-003-POOL":31,"tool:PLANT-002-TOOL-FURNACE-01":12,"buffer:PLANT-004-T1-4-BUF":53,"tool:PLANT-002-TOOL-HOB-01":11,"machine:PLANT-004-M-002":44,"machine:PLANT-004-M-004":46,"machine:PLANT-004-M-003":45,"buffer:PLANT-002-HALB-2-BUF":16,"buffer:PLANT-002-T1-2-BUF":18,"machine:PLANT-001-M-001":1,"transport:PLANT-001->PLANT-002:PLANT-003-T0-3":38,"machine:PLANT-001-M-002":2,"tool:PLANT-004-TOOL-FURNACE-01":50,"buffer:PLANT-004-HALB-4-BUF":51,"machine:PLANT-003-M-003":29,"labor_pool:PLANT-004-POOL":48,"buffer:PLANT-001-HALB-1-BUF":13,"machine:PLANT-004-M-001":43,"buffer:PLANT-003-HALB-3-BUF":34,"buffer:PLANT-004-T0-4-BUF":52,"transport:PLANT-001->PLANT-002:PLANT-002-HALB-2":22,"transport:PLANT-001->PLANT-002:PLANT-001-T1-1":21,"transport:PLANT-001->PLANT-002:PLANT-004-HALB-4":54,"machine:PLANT-002-M-003":6,"transport:PLANT-001->PLANT-002:PLANT-001-HALB-1":19,"machine:PLANT-003-M-004":30,"buffer:PLANT-002-T0-2-BUF":17,"machine:PLANT-001-M-005":40,"buffer:PLANT-003-T1-3-BUF":36,"machine:PLANT-003-M-002":28,"transport:PLANT-001->PLANT-002:PLANT-002-T0-2":23,"machine:PLANT-002-M-001":4,"buffer:PLANT-001-T1-1-BUF":15,"machine:PLANT-003-M-001":27,"labor_pool:PLANT-002-POOL":8,"tool:PLANT-004-TOOL-HOB-01":49,"transport:PLANT-001->PLANT-002:PLANT-002-T1-2":24,"transport:PLANT-001->PLANT-002:PLANT-004-T0-4":55,"buffer:PLANT-001-T0-1-BUF":14,"transport:PLANT-001->PLANT-002:PLANT-004-T1-4":56,"machine:PLANT-004-M-005":47,"tool:PLANT-001-TOOL-FURNACE-01":10,"machine:PLANT-002-M-005":41,"<UNK>":0,"machine:PLANT-002-M-004":26,"tool:PLANT-003-TOOL-HOB-01":32,"buffer:PLANT-003-T0-3-BUF":35,"machine:PLANT-001-M-003":3,"transport:PLANT-001->PLANT-002:PLANT-003-T1-3":39,"transport:PLANT-001->PLANT-002:PLANT-001-T0-1":20,"transport:PLANT-001->PLANT-002:PLANT-003-HALB-3":37,"machine:PLANT-003-M-005":42},"frozen":true},"score_name_dict":{"mapping":{"plants":1,"machines":2,"<UNK>":0,"orders":3},"frozen":true}}